package com.japanese.ohanashi.stories

import com.japanese.ohanashi.R
import com.japanese.ohanashi.Story
import com.japanese.ohanashi.StoryCard

val shirayukihime =
Story(
    title = "[白雪姫;しらゆきひめ]",
    audioId = R.raw.shirayukihime,
    cards = listOf(
        StoryCard(
            text =
            "むかしむかし、とっても[美;うつく]しいけれど、[心;こころ]のみにくいおきさきがいました。\n" +
                    "おきさきは[魔法;まほう]のカガミを[持;と]っていて、いつも[魔法;まほう]のカガミにたずねます。\n" +
                    "「カガミよカガミよ、この[世;よ]で[一番;いちばん][美;うつく]しいのは[誰;だれ]？」\n" +
                    "おきさきは、カガミがいつもの[様;よう]に、\n" +
                    "「あなたが、[一番;いちばん][美;うつく]しいです」\n" +
                    "と、[答;こた]えるのを[待;ま]ちました。\n" +
                    "しかしカガミは、\n" +
                    "「あなたの[娘;むすめ]、[白雪姫;しらゆきひめ]です」\n" +
                    "と、[答;こた]えたのです。\n" +
                    "おきさきは、[白雪姫;しらゆきひめ]の２[度目;どめ]のお[母;かあ]さんです。\n" +
                    "おきさきは[激;はげ]しく[腹;はら]を[立;た]て、[白雪姫;しらゆきひめ]を[猟師;りょうし]に[殺;ころ]させようとしました。\n" +
                    "でも[心;こころ]の[優;やさ]しい[猟師;りょうし]は[白雪姫;しらゆきひめ]をそっと[森;もり]の[中;なか]に[隠;かく]して、おきさきには[白雪姫;しらゆきひめ]を[殺;ころ]したとうそをついたのです。\n" +
                    "[白雪姫;しらゆきひめ]は、[森;もり]に[住;す]む[七人;しちにん]の[小人;こびと]たちと[暮;く]らす[事;こと]になりました。\n" +
                    "そして[小人;こびと]たちが[山;やま]に[働;はたら]きに[行;い]っている[間;あいだ]、[掃除;そうじ]や[洗濯;せんたく]や[針仕事;はりしごと]をしたり、ごはんを作ったりして毎日を[楽;たの]しく[過;す]ごしました。\n" +
                    "「[白雪姫;しらゆきひめ]、わたしたちが[仕事;しごと]に[行;い]っている[間;あいだ]、[誰;だれ]も[家;いえ]に[入;い]れちゃいけないよ。あの[怖;こわい]いおきさきに、ここが[知;し]られてしまうからね」\n" +
                    "と、いつも[小人;こびと]たちは[言;い]うのでした。\n" +
                    "ところがある[日;ひ]、\n" +
                    "「カガミよカガミよ、この[世;よ]で[一番;いちばん][美;うつく]しいのはだれ？」\n" +
                    "と、おきさきがカガミに[聞;き]くと、\n" +
                    "「[山;やま]を[越;こ]えたその[向;む]こう、[七人;しちにん]の[小人;こびと]の[家;いえ]にいる[白雪姫;しらゆきひめ]です」\n" +
                    "と、[答;こた]えたのです。\n" +
                    "「なんですって！！　あの[猟師;りょうし]、[裏切;うらぎ]ったね！　よし、こうなれば」\n" +
                    "　[自分;じぶん]で[白雪姫;しらゆきひめ]を[殺;ころ]そうと[考;かんが]えたおきさきは、[物売;ものう]りのおばあさんに[化;ば]けると、[毒;どく]リンゴを[手;て]に[七;なな]つの[山;やま]を[越;こ]えて[小人;こびと]の[家;いえ]に[行;い]きました。\n" +
                    "　そして、[窓;まど]を[叩;たた]いて[言;い]いました。\n" +
                    "「[美;うつく]しい[娘;むすめ]さんに、おくり[物;もの]だよ」\n" +
                    "「まあ、[何;なん]てきれいなリンゴ。おばあさん、ありがとう」\n" +
                    "　けれど、そのリンゴを[一口;ひとくち]かじるなり[白雪姫;しらゆきひめ]はバタリと[倒;たお]れて、[二度;にど]と[目;め]を[開;ひら]きませんでした。\n" +
                    "　[白雪姫;しらゆきひめ]が[死;し]んだ[事;こと]を[知;し]った[小人;こびと]たちは[悲;かな]しみ、せめて[美;うつく]しい[白雪姫;しらゆきひめ]がいつでも[見;み]られる[様;よう]にと、ガラスのひつぎの[中;なか]に[白雪姫;しらゆきひめ]を[寝;ね]かせて[森;もり]の[中;なか]に[置;お]きました。\n" +
                    "　そしてある[日;ひ]、１人の[王子;おうじ]が[森;もり]で、[白雪姫;しらゆきひめ]のひつぎを[見;み]つけたのです。\n" +
                    "「[何;なん]てきれいな[姫;ひめ]なんだ。まるで[眠;ねむ]っているようだ」\n" +
                    "　[王子;おうじ]は[思;おも]わず、ひつぎの[中;なか]の[白雪姫;しらゆきひめ]にキスをしました。\n" +
                    "　するとキスしたはずみで、[毒;どく]リンゴのかけらが[白雪姫;しらゆきひめ]ののどから[飛;と]び[出;だ]したのです。\n" +
                    "　[目;め]を[開;あ]けた[白雪姫;しらゆきひめ]は、\n" +
                    "「わたしは、どこにいるのかしら？」\n" +
                    "と、[王子;おうじ]に[尋;たず]ねました。\n" +
                    "「ずっと、わたしと[一緒;いっしょ]にいるのですよ。[姫;ひめ]」\n" +
                    "　[王子;おうじ]と[結婚;けっこん]した[白雪姫;しらゆきひめ]は、ずっと[幸;しあわ]せに[暮;く]らしました。\n" +
                    "おしまい",
        ),
        StoryCard(
            text = "むかしむかし、とっても[美;うつく]しいけれど、[心;こころ]のみにくいおきさきがいました。",
            notes = "- [美;うつく]しい, beautiful\n" +
                    "- とても, very (とっても is more emphatic)\n" +
                    "- けれど, but \n" +
                    "- みにくい, ugly\n" +
                    "- [心;こころ], heart\n" +
                    "- (お)きさき, empress/queen",
            audioStartTime = 3f,
            audioEndTime   = 10f
        ),
        StoryCard(
            text = "おきさきは[魔法;まほう]のカガミを[持;と]っていて、いつも[魔法;まほう]のカガミにたずねます。",
            notes = "- 魔法[まほう], magic/witchcraft/sorcery\n" +
                    "- いつも, always\n" +
                    "- たずね, question",
            audioStartTime = 11f,
            audioEndTime   = 18f
        ),
        StoryCard(
            text = "「カガミよカガミよ、この[世;よ]で[一番;いちばん][美;うつく]しいのは[誰;だれ]？」",
            notes = "- 世[よ], world/era\n" +
                    "- 一番[いちばん], number one/most-/greatest",
            audioStartTime = 19f,
            audioEndTime   = 27f
        ),
        StoryCard(
            text = "おきさきは、カガミがいつもの[様;よう]に、\n" +
                    "「あなたが、[一番;いちばん][美;うつく]しいです」\n" +
                    "と、[答;こた]えるのを[待;ま]ちました。",
            notes = "- 様[よう], like/similar to\n" +
                    "- いつもの様に, always' likeness/ like always \n" +
                    "- 待つ[まつ], to wait" +
                    "- しかし, however/but\n" +
                    "- 娘[むすめ], daughter",
            audioStartTime = 28f,
            audioEndTime   = 40f
        ),
        StoryCard(
            text = "しかしカガミは、\n" +
                    "「あなたの[娘;むすめ]、[白雪姫;しらゆきひめ]です」\n" +
                    "と、[答;こた]えたのです。",
            notes = "- ２度目[にどめ], the second time",
            audioEndTime   = 50f
        ),
        StoryCard(
            text = "おきさきは、[白雪姫;しらゆきひめ]の２[度目;どめ]のお[母;かあ]さんです。",
            notes = "- 激[はげ]しい, violent/furious\n" +
                    "- 腹[はら], stomach/belly\n" +
                    "- 立[た]てる, to raise/stand up\n" +
                    "- 猟師[りょうし], hunter\n" +
                    "- 殺[ころ]す, to kill \n" +
                    "- 殺させ, cause to kill (in this case probably \"order to kill\")\n" +
                    "- (ようと, use/service/purpose?)",
            audioEndTime   = 54f,
        ),
        StoryCard(
            text = "おきさきは[激;はげ]しく[腹;はら]を[立;た]て、[白雪姫;しらゆきひめ]を[猟師;りょうし]に[殺;ころ]させようとしました。",
            audioEndTime   = 62f,
        ),
        StoryCard(
            text = "でも[心;こころ]の[優;やさ]しい[猟師;りょうし]は[白雪姫;しらゆきひめ]をそっと[森;もり]の[中;なか]に[隠;かく]して、おきさきには[白雪姫;しらゆきひめ]を[殺;ころ]したとうそをついたのです。",
            notes = "- そっと, softly/quietly\n" +
                    "- 森[もり], forest\n" +
                    "- 中[なか], inside\n" +
                    "- 隠す[かくす], to hide\n" +
                    "- うそ, lie\n" +
                    "- つく, ",
            audioEndTime   = 74.5f,
        ),
        StoryCard(
            text = "[白雪姫;しらゆきひめ]は、[森;もり]に[住;す]む[七人;しちにん]の[小人;こびと]たちと[暮;く]らす[事;こと]になりました。",
            notes = "- 住む[すむ], to live/reside\n" +
                    "- 小人[こびと], dwarf/dwarfism\n" +
                    "- 暮らす[くらす], to live/get along/spend (time)",
            audioEndTime   = 81f,
        ),
        StoryCard(
            text = "そして[小人;こびと]たちが[山;やま]に[働;はたら]きに[行;い]っている[間;あいだ]、[掃除;そうじ]や[洗濯;せんたく]や[針仕事;はりしごと]をしたり、ごはんを作ったりして毎日を[楽;たの]しく[過;す]ごしました。",
            notes = "- そして, and/and then\n" +
                    "- 間[あいだ], \n" +
                    "- 掃除[そうじ], cleaning/sweeping/dusting/scrubbing\n" +
                    "- 洗濯[せんたく], laundry\n" +
                    "- 針仕事[はりしごと], needlework\n" +
                    "- たり/だり ending used for non-exhaustive list of actions. Marks ‘representative activities’ ‘I did things like …’\n" +
                    "- や used for non-exhaustive list of objects\n" +
                    "- 楽[たの]しい, fun\n" +
                    "- 過[す]ごす, to pass (time)/to spend;take care of/support\n" +
                    "- And while the dwarfs went to work in the mountains,\n" +
                    "- [Snowwhite] joyfully spent each day cleaning, washing, doing needlework and making meals.",
            audioStartTime = 82f,
            audioEndTime   = 95f,
        ),
        StoryCard(
            text = "「[白雪姫;しらゆきひめ]、わたしたちが[仕事;しごと]に[行;い]っている[間;あいだ]、[誰;だれ]も[家;いえ]に[入;い]れちゃいけないよ。あの[怖;こわい]いおきさきに、ここが[知;し]られてしまうからね」",
            notes = "- 怖[こわ]い, scary\n" +
                    "- 知[し]られる, to be known\n" +
                    "- しまう, to finish/stop/end\n" +
                    "- “Snowwhite, while we are at work, you should not let anyone in the house. That scary queen will find out about this place\" the dwarfs always said",
            audioEndTime   = 107f,
        ),
        StoryCard(
            text = "と、いつも[小人;こびと]たちは[言;い]うのでした。",
            audioEndTime   = 111f,
        ),
        StoryCard(
            text = "ところがある[日;ひ]、\n" +
                    "「カガミよカガミよ、この[世;よ]で[一番;いちばん][美;うつく]しいのはだれ？」\n" +
                    "と、おきさきがカガミに[聞;き]くと、",
            audioStartTime = 112f,
            audioEndTime   = 127f,
        ),
        StoryCard(
            text = "「[山;やま]を[越;こ]えたその[向;む]こう、[七人;しちにん]の[小人;こびと]の[家;いえ]にいる[白雪姫;しらゆきひめ]です」\n" +
                    "と、[答;こた]えたのです。",
            audioEndTime   = 137f,
        ),
        StoryCard(
            text = "「なんですって！！　あの[猟師;りょうし]、[裏切;うらぎ]ったね！　よし、こうなれば」",
            audioEndTime   = 146f,
        ),
        StoryCard(
            text = "[自分;じぶん]で[白雪姫;しらゆきひめ]を[殺;ころ]そうと[考;かんが]えたおきさきは、[物売;ものう]りのおばあさんに[化;ば]けると、[毒;どく]リンゴを[手;て]に[七;なな]つの[山;やま]を[越;こ]えて[小人;こびと]の[家;いえ]に[行;い]きました。",
            audioEndTime   = 159f,
        ),
        StoryCard(
            text = "そして、[窓;まど]を[叩;たた]いて[言;い]いました。",
            audioStartTime = 159f,
            audioEndTime   = 163f,
        ),
        StoryCard(
            text = "「[美;うつく]しい[娘;むすめ]さんに、おくり[物;もの]だよ」",
            audioEndTime   = 169.5f,
        ),
        StoryCard(
            text = "「まあ、[何;なん]てきれいなリンゴ。おばあさん、ありがとう」",
            audioEndTime   = 178f,
        ),
        StoryCard(
            text = "けれど、そのリンゴを[一口;ひとくち]かじるなり[白雪姫;しらゆきひめ]はバタリと[倒;たお]れて、[二度;にど]と[目;め]を[開;ひら]きませんでした。",
            audioEndTime   = 187f,
        ),
        StoryCard(
            text = "[白雪姫;しらゆきひめ]が[死;し]んだ[事;こと]を[知;し]った[小人;こびと]たちは[悲;かな]しみ、せめて[美;うつく]しい[白雪姫;しらゆきひめ]がいつでも[見;み]られる[様;よう]にと、ガラスのひつぎの[中;なか]に[白雪姫;しらゆきひめ]を[寝;ね]かせて[森;もり]の[中;なか]に[置;お]きました。",
            audioEndTime   = 201f,
        ),
        StoryCard(
            text = "そしてある[日;ひ]、１人の[王子;おうじ]が[森;もり]で、[白雪姫;しらゆきひめ]のひつぎを[見;み]つけたのです。",
            audioEndTime   = 207f,
        ),
        StoryCard(
            text = "「[何;なん]てきれいな[姫;ひめ]なんだ。まるで[眠;ねむ]っているようだ」",
            audioEndTime   = 212f,
        ),
        StoryCard(
            text = "[王子;おうじ]は[思;おも]わず、ひつぎの[中;なか]の[白雪姫;しらゆきひめ]にキスをしました。",
            audioEndTime   = 218f,
        ),
        StoryCard(
            text = "するとキスしたはずみで、[毒;どく]リンゴのかけらが[白雪姫;しらゆきひめ]ののどから[飛;と]び[出;だ]したのです。",
            audioEndTime   = 226f,
        ),
        StoryCard(
            text = "[目;め]を[開;あ]けた[白雪姫;しらゆきひめ]は、" +
                    "「わたしは、どこにいるのかしら？」" +
                    "と、[王子;おうじ]に[尋;たず]ねました。",
            audioEndTime   = 235f,
        ),
        StoryCard(
            text = "「ずっと、わたしと[一緒;いっしょ]にいるのですよ。[姫;ひめ]」",
            audioEndTime   = 241f,
        ),
        StoryCard(
            text = "[王子;おうじ]と[結婚;けっこん]した[白雪姫;しらゆきひめ]は、ずっと[幸;しあわ]せに[暮;く]らしました。\n" +
                    "おしまい",
        ),
    )
)